Model: "model_1"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to
==================================================================================================
input_1 (InputLayer)            (None, 3600)         0
__________________________________________________________________________________________________
reshape_1 (Reshape)             (None, 3600, 1)      0           input_1[0][0]
__________________________________________________________________________________________________
conv1d_1 (Conv1D)               (None, 3600, 128)    512         reshape_1[0][0] #conv1
__________________________________________________________________________________________________
global_max_pooling1d_1 (GlobalM (None, 128)          0           conv1d_1[0][0] #max1
__________________________________________________________________________________________________
global_average_pooling1d_1 (Glo (None, 128)          0           conv1d_1[0][0] #avg1
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 256)          0           global_max_pooling1d_1[0][0]
                                                                 global_average_pooling1d_1[0][0]
                                                                 #conca1
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 128)          32896       concatenate_1[0][0] #dense1
__________________________________________________________________________________________________
repeat_vector_1 (RepeatVector)  (None, Dimension(360 0           dense_1[0][0] #repeat1
__________________________________________________________________________________________________
multiply_1 (Multiply)           (None, Dimension(360 0           repeat_vector_1[0][0]
                                                                 conv1d_1[0][0]
__________________________________________________________________________________________________
conv1d_2 (Conv1D)               (None, Dimension(360 49280       multiply_1[0][0]
__________________________________________________________________________________________________
global_max_pooling1d_2 (GlobalM (None, 128)          0           conv1d_2[0][0]
__________________________________________________________________________________________________
global_average_pooling1d_2 (Glo (None, 128)          0           conv1d_2[0][0]
__________________________________________________________________________________________________
concatenate_2 (Concatenate)     (None, 256)          0           global_max_pooling1d_2[0][0]
                                                                 global_average_pooling1d_2[0][0]
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 128)          32896       concatenate_2[0][0]
__________________________________________________________________________________________________
repeat_vector_2 (RepeatVector)  (None, Dimension(360 0           dense_2[0][0]
__________________________________________________________________________________________________
multiply_2 (Multiply)           (None, Dimension(360 0           repeat_vector_2[0][0]
                                                                 conv1d_2[0][0]
__________________________________________________________________________________________________
conv1d_3 (Conv1D)               (None, Dimension(360 49280       multiply_2[0][0]
__________________________________________________________________________________________________
global_max_pooling1d_3 (GlobalM (None, 128)          0           conv1d_3[0][0]
__________________________________________________________________________________________________
global_average_pooling1d_3 (Glo (None, 128)          0           conv1d_3[0][0]
__________________________________________________________________________________________________
concatenate_3 (Concatenate)     (None, 256)          0           global_max_pooling1d_3[0][0]
                                                                 global_average_pooling1d_3[0][0]
__________________________________________________________________________________________________
dense_3 (Dense)                 (None, 128)          32896       concatenate_3[0][0]
__________________________________________________________________________________________________
repeat_vector_3 (RepeatVector)  (None, Dimension(360 0           dense_3[0][0]
__________________________________________________________________________________________________
conv1d_4 (Conv1D)               (None, 3600, 128)    256         reshape_1[0][0]
__________________________________________________________________________________________________
multiply_3 (Multiply)           (None, Dimension(360 0           repeat_vector_3[0][0]
                                                                 conv1d_3[0][0]
__________________________________________________________________________________________________
add_1 (Add)                     (None, 3600, 128)    0           conv1d_4[0][0]
                                                                 multiply_3[0][0]
__________________________________________________________________________________________________
max_pooling1d_1 (MaxPooling1D)  (None, 1800, 128)    0           add_1[0][0]
__________________________________________________________________________________________________
conv1d_5 (Conv1D)               (None, 1800, 64)     24640       max_pooling1d_1[0][0]
__________________________________________________________________________________________________
global_max_pooling1d_4 (GlobalM (None, 64)           0           conv1d_5[0][0]
__________________________________________________________________________________________________
global_average_pooling1d_4 (Glo (None, 64)           0           conv1d_5[0][0]
__________________________________________________________________________________________________
concatenate_4 (Concatenate)     (None, 128)          0           global_max_pooling1d_4[0][0]
                                                                 global_average_pooling1d_4[0][0]
__________________________________________________________________________________________________
dense_4 (Dense)                 (None, 64)           8256        concatenate_4[0][0]
__________________________________________________________________________________________________
repeat_vector_4 (RepeatVector)  (None, Dimension(180 0           dense_4[0][0]
__________________________________________________________________________________________________
multiply_4 (Multiply)           (None, Dimension(180 0           repeat_vector_4[0][0]
                                                                 conv1d_5[0][0]
__________________________________________________________________________________________________
conv1d_6 (Conv1D)               (None, Dimension(180 12352       multiply_4[0][0]
__________________________________________________________________________________________________
global_max_pooling1d_5 (GlobalM (None, 64)           0           conv1d_6[0][0]
__________________________________________________________________________________________________
global_average_pooling1d_5 (Glo (None, 64)           0           conv1d_6[0][0]
__________________________________________________________________________________________________
concatenate_5 (Concatenate)     (None, 128)          0           global_max_pooling1d_5[0][0]
                                                                 global_average_pooling1d_5[0][0]
__________________________________________________________________________________________________
dense_5 (Dense)                 (None, 64)           8256        concatenate_5[0][0]
__________________________________________________________________________________________________
repeat_vector_5 (RepeatVector)  (None, Dimension(180 0           dense_5[0][0]
__________________________________________________________________________________________________
multiply_5 (Multiply)           (None, Dimension(180 0           repeat_vector_5[0][0]
                                                                 conv1d_6[0][0]
__________________________________________________________________________________________________
conv1d_7 (Conv1D)               (None, Dimension(180 12352       multiply_5[0][0]
__________________________________________________________________________________________________
global_max_pooling1d_6 (GlobalM (None, 64)           0           conv1d_7[0][0]
__________________________________________________________________________________________________
global_average_pooling1d_6 (Glo (None, 64)           0           conv1d_7[0][0]
__________________________________________________________________________________________________
concatenate_6 (Concatenate)     (None, 128)          0           global_max_pooling1d_6[0][0]
                                                                 global_average_pooling1d_6[0][0]
__________________________________________________________________________________________________
dense_6 (Dense)                 (None, 64)           8256        concatenate_6[0][0]
__________________________________________________________________________________________________
repeat_vector_6 (RepeatVector)  (None, Dimension(180 0           dense_6[0][0]
__________________________________________________________________________________________________
conv1d_8 (Conv1D)               (None, 1800, 64)     8256        max_pooling1d_1[0][0]
__________________________________________________________________________________________________
multiply_6 (Multiply)           (None, Dimension(180 0           repeat_vector_6[0][0]
                                                                 conv1d_7[0][0]
__________________________________________________________________________________________________
add_2 (Add)                     (None, 1800, 64)     0           conv1d_8[0][0]
                                                                 multiply_6[0][0]
__________________________________________________________________________________________________
max_pooling1d_2 (MaxPooling1D)  (None, 900, 64)      0           add_2[0][0]
__________________________________________________________________________________________________
conv1d_9 (Conv1D)               (None, 900, 32)      6176        max_pooling1d_2[0][0]
__________________________________________________________________________________________________
global_max_pooling1d_7 (GlobalM (None, 32)           0           conv1d_9[0][0]
__________________________________________________________________________________________________
global_average_pooling1d_7 (Glo (None, 32)           0           conv1d_9[0][0]
__________________________________________________________________________________________________
concatenate_7 (Concatenate)     (None, 64)           0           global_max_pooling1d_7[0][0]
                                                                 global_average_pooling1d_7[0][0]
__________________________________________________________________________________________________
dense_7 (Dense)                 (None, 32)           2080        concatenate_7[0][0]
__________________________________________________________________________________________________
repeat_vector_7 (RepeatVector)  (None, Dimension(900 0           dense_7[0][0]
__________________________________________________________________________________________________
multiply_7 (Multiply)           (None, Dimension(900 0           repeat_vector_7[0][0]
                                                                 conv1d_9[0][0]
__________________________________________________________________________________________________
conv1d_10 (Conv1D)              (None, Dimension(900 3104        multiply_7[0][0]
__________________________________________________________________________________________________
global_max_pooling1d_8 (GlobalM (None, 32)           0           conv1d_10[0][0]
__________________________________________________________________________________________________
global_average_pooling1d_8 (Glo (None, 32)           0           conv1d_10[0][0]
__________________________________________________________________________________________________
concatenate_8 (Concatenate)     (None, 64)           0           global_max_pooling1d_8[0][0]
                                                                 global_average_pooling1d_8[0][0]
__________________________________________________________________________________________________
dense_8 (Dense)                 (None, 32)           2080        concatenate_8[0][0]
__________________________________________________________________________________________________
repeat_vector_8 (RepeatVector)  (None, Dimension(900 0           dense_8[0][0]
__________________________________________________________________________________________________
multiply_8 (Multiply)           (None, Dimension(900 0           repeat_vector_8[0][0]
                                                                 conv1d_10[0][0]
__________________________________________________________________________________________________
conv1d_11 (Conv1D)              (None, Dimension(900 3104        multiply_8[0][0]
__________________________________________________________________________________________________
global_max_pooling1d_9 (GlobalM (None, 32)           0           conv1d_11[0][0]
__________________________________________________________________________________________________
global_average_pooling1d_9 (Glo (None, 32)           0           conv1d_11[0][0]
__________________________________________________________________________________________________
concatenate_9 (Concatenate)     (None, 64)           0           global_max_pooling1d_9[0][0]
                                                                 global_average_pooling1d_9[0][0]
__________________________________________________________________________________________________
dense_9 (Dense)                 (None, 32)           2080        concatenate_9[0][0]
__________________________________________________________________________________________________
repeat_vector_9 (RepeatVector)  (None, Dimension(900 0           dense_9[0][0]
__________________________________________________________________________________________________
conv1d_12 (Conv1D)              (None, 900, 32)      2080        max_pooling1d_2[0][0]
__________________________________________________________________________________________________
multiply_9 (Multiply)           (None, Dimension(900 0           repeat_vector_9[0][0]
                                                                 conv1d_11[0][0]
__________________________________________________________________________________________________
add_3 (Add)                     (None, 900, 32)      0           conv1d_12[0][0]
                                                                 multiply_9[0][0]
__________________________________________________________________________________________________
max_pooling1d_3 (MaxPooling1D)  (None, 450, 32)      0           add_3[0][0]
__________________________________________________________________________________________________
conv1d_13 (Conv1D)              (None, 450, 16)      1552        max_pooling1d_3[0][0]
__________________________________________________________________________________________________
global_max_pooling1d_10 (Global (None, 16)           0           conv1d_13[0][0]
__________________________________________________________________________________________________
global_average_pooling1d_10 (Gl (None, 16)           0           conv1d_13[0][0]
__________________________________________________________________________________________________
concatenate_10 (Concatenate)    (None, 32)           0           global_max_pooling1d_10[0][0]
                                                                 global_average_pooling1d_10[0][0]
__________________________________________________________________________________________________
dense_10 (Dense)                (None, 16)           528         concatenate_10[0][0]
__________________________________________________________________________________________________
repeat_vector_10 (RepeatVector) (None, Dimension(450 0           dense_10[0][0]
__________________________________________________________________________________________________
multiply_10 (Multiply)          (None, Dimension(450 0           repeat_vector_10[0][0]
                                                                 conv1d_13[0][0]
__________________________________________________________________________________________________
conv1d_14 (Conv1D)              (None, Dimension(450 784         multiply_10[0][0]
__________________________________________________________________________________________________
global_max_pooling1d_11 (Global (None, 16)           0           conv1d_14[0][0]
__________________________________________________________________________________________________
global_average_pooling1d_11 (Gl (None, 16)           0           conv1d_14[0][0]
__________________________________________________________________________________________________
concatenate_11 (Concatenate)    (None, 32)           0           global_max_pooling1d_11[0][0]
                                                                 global_average_pooling1d_11[0][0]
__________________________________________________________________________________________________
dense_11 (Dense)                (None, 16)           528         concatenate_11[0][0]
__________________________________________________________________________________________________
repeat_vector_11 (RepeatVector) (None, Dimension(450 0           dense_11[0][0]
__________________________________________________________________________________________________
multiply_11 (Multiply)          (None, Dimension(450 0           repeat_vector_11[0][0]
                                                                 conv1d_14[0][0]
__________________________________________________________________________________________________
conv1d_15 (Conv1D)              (None, Dimension(450 784         multiply_11[0][0]
__________________________________________________________________________________________________
global_max_pooling1d_12 (Global (None, 16)           0           conv1d_15[0][0]
__________________________________________________________________________________________________
global_average_pooling1d_12 (Gl (None, 16)           0           conv1d_15[0][0]
__________________________________________________________________________________________________
concatenate_12 (Concatenate)    (None, 32)           0           global_max_pooling1d_12[0][0]
                                                                 global_average_pooling1d_12[0][0]
__________________________________________________________________________________________________
dense_12 (Dense)                (None, 16)           528         concatenate_12[0][0]
__________________________________________________________________________________________________
repeat_vector_12 (RepeatVector) (None, Dimension(450 0           dense_12[0][0]
__________________________________________________________________________________________________
conv1d_16 (Conv1D)              (None, 450, 16)      528         max_pooling1d_3[0][0]
__________________________________________________________________________________________________
multiply_12 (Multiply)          (None, Dimension(450 0           repeat_vector_12[0][0]
                                                                 conv1d_15[0][0]
__________________________________________________________________________________________________
add_4 (Add)                     (None, 450, 16)      0           conv1d_16[0][0]
                                                                 multiply_12[0][0]
__________________________________________________________________________________________________
max_pooling1d_4 (MaxPooling1D)  (None, 225, 16)      0           add_4[0][0]
__________________________________________________________________________________________________
dropout_1 (Dropout)             (None, 225, 16)      0           max_pooling1d_4[0][0]
__________________________________________________________________________________________________
flatten_1 (Flatten)             (None, 3600)         0           dropout_1[0][0]
__________________________________________________________________________________________________
dense_13 (Dense)                (None, 2048)         7374848     flatten_1[0][0] #layer1
__________________________________________________________________________________________________
dropout_2 (Dropout)             (None, 2048)         0           dense_13[0][0]
__________________________________________________________________________________________________
dense_14 (Dense)                (None, 1024)         2098176     dropout_2[0][0] #layer2
__________________________________________________________________________________________________
dropout_3 (Dropout)             (None, 1024)         0           dense_14[0][0]
__________________________________________________________________________________________________
dense_15 (Dense)                (None, 512)          524800      dropout_3[0][0] #layer3
__________________________________________________________________________________________________
dropout_4 (Dropout)             (None, 512)          0           dense_15[0][0]
__________________________________________________________________________________________________
dense_16 (Dense)                (None, 256)          131328      dropout_4[0][0] #layer4
__________________________________________________________________________________________________
dropout_5 (Dropout)             (None, 256)          0           dense_16[0][0] #dropout
__________________________________________________________________________________________________
dense_17 (Dense)                (None, 128)          32896       dropout_5[0][0] #layer5
__________________________________________________________________________________________________
dense_18 (Dense)                (None, 64)           8256        dense_17[0][0] #layer6
__________________________________________________________________________________________________
dense_19 (Dense)                (None, 32)           2080        dense_18[0][0] #layer7
__________________________________________________________________________________________________
dense_20 (Dense)                (None, 16)           528         dense_19[0][0] #layer8
__________________________________________________________________________________________________
dense_21 (Dense)                (None, 8)            136         dense_20[0][0] #layer9
__________________________________________________________________________________________________
dense_22 (Dense)                (None, 1)            9           dense_21[0][0] #output
==================================================================================================
Total params: 10,479,377
Trainable params: 10,479,377
Non-trainable params: 0
__________________________________________________________________________________________________
None